Repository: olympus-app/Olympus
Catalog: Packages/Olympus.Generators/Resources/Strings.*.resx
Languages: es, pt

# EmptyResourceFileTitle
source: Empty resource file
es: Archivo de recursos vacío
pt: Arquivo de recurso vazio

# EmptyResourceFileMessage
source: Resource file generated without any members
es: Archivo de recurso generado sin ningún miembro
pt: Arquivo de recursos gerado sem nenhum membro

# EmptyResourceFileDescription
source: Resource file should have at least one member.
es: El archivo de recursos debería tener al menos un miembro.
pt: O arquivo de recursos deve ter pelo menos um membro.

# InvalidResourceKeyTitle
source: Invalid key in resource file
es: Clave inválida en el archivo de recursos
pt: Chave inválida no arquivo de recurso

# InvalidResourceKeyMessage
source: Entry with key '{0}' is invalid and will be ignored
es: La entrada con la clave '{0}' es inválida y será ignorada
pt: A entrada com a chave '{0}' é inválida e será ignorada

# InvalidResourceKeyDescription
source: Resource keys must be valid.
es: Las claves de recursos deben ser válidas.
pt: Chaves de recursos devem ser válidas.

# MissingResourceValueTitle
source: Missing value in resource file
es: Valor faltante en el archivo de recursos
pt: Valor faltante no arquivo de recurso

# MissingResourceValueMessage
source: Entry with key '{0}' has no value and will be ignored
es: La entrada con la clave '{0}' no tiene valor y será ignorada
pt: Entrada com a chave '{0}' não tem valor e será ignorada

# MissingResourceValueDescription
source: Resource keys must be valid.
es: Las claves de recursos deben ser válidas.
pt: Chaves de recursos devem ser válidas.

# DuplicateResourceKeyTitle
source: Duplicate key in resource file
es: Clave duplicada en el archivo de recursos
pt: Chave duplicada no arquivo de recurso

# DuplicateResourceKeyMessage
source: Entry with key '{0}' is duplicated and will be ignored
es: La entrada con la clave '{0}' se duplica y será ignorada
pt: A entrada com a chave '{0}' é duplicada e será ignorada

# DuplicateResourceKeyDescription
source: Resource keys should not be duplicates.
es: Las claves de recursos no deberían ser duplicados.
pt: Chaves de recursos não devem ser duplicadas.

# MissingResourceTranslationTitle
source: Missing translation for specific key
es: Falta la traducción para una clave específica
pt: Falta tradução para uma chave específica

# MissingResourceTranslationMessage
source: Entry with key '{0}' is missing a translation for {1} ({2})
es: La entrada con la clave '{0}' carece de traducción para {1} ({2})
pt: A entrada com a chave '{0}' está sem tradução para {1} ({2})

# MissingResourceTranslationDescription
source: Resource entries must have translations for all supported languages.
es: Las entradas de recursos deben tener traducciones para todos los idiomas soportados.
pt: As entradas de recursos devem ter traduções para todos os idiomas suportados.

# InvalidPermissionIdentifierTitle
source: Invalid permission identifier
es: Identificador de permiso no válido
pt: Identificador de permissão inválido

# InvalidPermissionIdentifierMessage
source: The permission identifier for key '{0}' must be a valid integer
es: El identificador de permiso para la clave '{0}' debe ser un número entero válido
pt: O identificador de permissão para a chave '{0}' deve ser um inteiro válido

# InvalidPermissionIdentifierDescription
source: Permission identifier must be a valid integer.
es: El identificador de permiso debe ser un número entero válido.
pt: O identificador de permissão deve ser um inteiro válido.

# DuplicatePermissionIdentifierTitle
source: Duplicate permission identifier
es: Identificador de permiso duplicado
pt: Identificador de permissão duplicado

# DuplicatePermissionIdentifierMessage
source: The permission identifier for key '{0}' is already in use
es: El identificador de permiso para la clave '{0}' ya está en uso
pt: O identificador de permissão para a chave '{0}' já está em uso

# DuplicatePermissionIdentifierDescription
source: Permission identifier must be exclusive.
es: El identificador de permiso debe ser exclusivo.
pt: O identificador de permissão deve ser exclusivo.

# InvalidPermissionKeyTitle
source: Invalid permission key
es: Clave de permisos inválida
pt: Chave de permissão inválida

# InvalidPermissionKeyMessage
source: The permission key '{0}' must follow the format 'Module.Feature.Action'
es: La clave de permisos '{0}' debe seguir el formato 'Module.Feature.Action'
pt: A chave de permissão '{0}' deve seguir o formato 'Module.Feature.Action'

# InvalidPermissionKeyDescription
source: Permission identifier must follow the format 'Module.Feature.Action'.
es: El identificador de permiso debe seguir el formato 'Module.Feature.Action'.
pt: O identificador de permissão deve seguir o formato 'Module.Feature.Action'.

# InvalidRouteKeyTitle
source: Invalid route key
es: Clave de ruta no válida
pt: Chave de rota inválida

# InvalidRouteKeyMessage
source: The route key '{0}' must follow the format 'Module.Segments'
es: La clave de ruta '{0}' debe seguir el formato 'Module.Segments'
pt: A chave de rota '{0}' deve seguir o formato 'Module.Segments'

# InvalidRouteKeyDescription
source: Route identifier must follow the format 'Module.Segments'.
es: El identificador de ruta debe seguir el formato 'Module.Segments'.
pt: O identificador de rota deve seguir o formato 'Module.Segments'.

# ServiceLifecycleTitle
source: Service lifecycle violation
es: Violación del ciclo de vida del servicio
pt: Violação do ciclo de vida do serviço

# ServiceLifecycleMessage
source: The type '{0}' implements conflicting service lifecycles: {1}
es: El tipo '{0}' implementa ciclos de vida de servicio conflictivos: {1}
pt: O tipo '{0}' implementa ciclos de vida de serviço conflitantes: {1}

# ServiceLifecycleDescription
source: Enforces that a type implements only one specific service lifecycle strategy (Transient, Scoped, Singleton, Settings, or Complex) to avoid ambiguous dependency injection registration.
es: Exige que un tipo implemente solo una estrategia específica de ciclo de vida del servicio (Transitoria, Con Ámbito, Singleton, Configuración o Compleja) para evitar el registro ambiguo de inyección de dependencias.
pt: Impõe que um tipo implemente apenas uma estratégia de ciclo de vida de serviço específica (Transient, Scoped, Singleton, Settings ou Complex) para evitar registro de injeção de dependência ambíguo.
